#### BtuPerHFtSup2DegreeF Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol BTU/(hÂ·ftÂ²Â·Â°F), indicating unit British thermal units per hour square foot degree Fahrenheit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BtuPerHFtSup2DegreeF { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BtuPerHFtSup2DegreeF As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BtuPerHFtSup2DegreeF { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace